// explain below concepts and write an example for each one

// action:
//اکشن یک نوع آبجکت جاوا اسکریپته که دستوری رو برای تغییر به ریدیوسر می‌فرسته
//و 2تا ویژگی داره مثل تایپ که باید نوع اون ابجکت رو مشخص کنیم
// =====
// const action = {
//     type: 'INCREMENT',
//     payload: 1
//   };
// =========🔹🔹🔹🔹🔹🔹=================================🔹🔹🔹🔹🔹🔹=================================
// action creator:
// یک تابع است که یک آبجکت اکشن رو برمی‌گردوند.
// به مرتب‌سازی اکشن‌ها کمک می‌کنه و از قرار دادن مستقیم آن‌ها در کامپوننت‌ها جلوگیری می‌کنه
// ======
// const incrementAction = () => {
//     return {
//       type: 'INCREMENT',
//       payload: 1
//     };
//   };
// =========🔹🔹🔹🔹🔹🔹=================================🔹🔹🔹🔹🔹🔹=================================
// reducer:
//یک تابع  که استیت و یک اکشن رو می‌گیره و بعد استیت جدید رو بر اساسه آن اکشن برمی‌گردونه
// Reducer‌ها توضیح می‌دن که چطوری استیت برنامه باید در پاسخ به اکشن‌ها تغییر کند.

// =========🔹🔹🔹🔹🔹🔹=================================🔹🔹🔹🔹🔹🔹=================================
// store:
//مدیریت و فراهم کردن دسترسی به استیت ها رو بر عهده داره
// امکان اجرای اکشن‌ها و تغییرات استیت رو فراهم می‌کنه
// const store = createStore(counterReducer);
